bookmarks.md

# Table of Contents

1.  [Bookmarks](#org543465b)
    1.  [What is this about?](#org0230397)
    2.  [Udemy course](#org9b99825)
    3.  [IDEs](#org2ffec80)
    4.  [What is a programming language](#orge0b8cec)



<a id="org543465b"></a>

# Bookmarks


<a id="org0230397"></a>

## What is this about?

When I find an interesting article or video, I share it here. Most
of these are possible starting points for a short presentation, or
may be useful for your application research.

I usually look at the articles in some detail (though I rarely work
through them - that would be your job), and assign a label for the
difficulty level Lvl = 0 (simple), 1 (moderate), 2 (difficult), or 3
(hard). Sites or tutorials aren't labeled by difficulty.

Papers can be hard for different reason: length, technical
vocabulary, writing style, mathematics, number of citations etc. If
you find any of these interesting and want to use them for your
research, you might ask me why I assigned a particular level.


<a id="org9b99825"></a>

## Udemy course

-   [ ] [What is C programming? Learn the basics (2021)](https://blog.udemy.com/what-is-c-programming/)
-   [ ] [Udemy Course: Huw Collingbourne (2019)](https://www.udemy.com/course/c-programming-for-beginners/)


<a id="org2ffec80"></a>

## IDEs

-   [CodeLite](https://codelite.org): "CodeLite is an open source, free, cross platform IDE
    specialized in C, C++, PHP and JavaScript (mainly for backend
    developers using Node.js) programming languages which runs best
    on all major Platforms ( OSX, Windows and Linux)."
-   Download 64-bit version - exe file. Run it. Accept warning
    condition. Accept license. Accept path suggestions. Have
    additional shortcuts created (desktop and launcher).
-   Welcome screen asks for your profile (intended use): pick C/C++
    development.
-   Setup compilers: scan for existing compilers or install MinGW
    compiler. Download newer (stable) version if you like. Check out
    forums and wiki (both on the web).


<a id="orge0b8cec"></a>

## What is a programming language

A lot of vocal fry [in this video](https://www.codecademy.com/resources/blog/programming-languages/) but you can also just read the
transcript. Includes some good links, like [PYPL](https://pypl.github.io/PYPL.html). I have started the (free) C++
course from Codeacademy (they're a big online course provider).  

